<a href="https://colab.research.google.com/github/DSF-Kotaro/classroom/blob/main/%E3%80%90%E7%AC%AC%EF%BC%96%E5%9B%9E%E3%80%91%E3%83%A9%E3%82%A4%E3%83%96%E3%83%A9%E3%83%AA%E3%81%AE%E4%BD%BF%E3%81%84%E6%96%B9%EF%BC%88Pandas%EF%BC%89.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Pandasのインポート（Import Pandas）

In [32]:
import pandas as pd
from pandas import Series,DataFrame

##Seriesの使い方（How to use Series）

In [33]:
pandas_data = pd.Series([0,10,20,30,40,50,60,70,80,90])
pandas_data

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

###インデックスをアルファベットでつける（Attach alphabet indexes)

In [34]:
pandas_index_data = pd.Series(
    [0,10,20,30,40,50,60,70,80,90],
    index = ['a','b','c','d','e','f','g','h','i','j'])
pandas_index_data

a     0
b    10
c    20
d    30
e    40
f    50
g    60
h    70
i    80
j    90
dtype: int64

###インデックスの確認(Make sure indexes of Series)

In [35]:
pandas_index_data.values

array([ 0, 10, 20, 30, 40, 50, 60, 70, 80, 90])

###値の確認（Make sure values of Series）

In [36]:
pandas_index_data.values

array([ 0, 10, 20, 30, 40, 50, 60, 70, 80, 90])

##DataFrameの使い方（How to use DataFrame）

In [37]:
data = {'ID':['100','101','102','103','104'],
        'City':['Tokyo','Osaka','Kyoto','Fukuoka','Tokyo'],
        'Birth_year':[1990,1989,1992,1997,1982],
        'Name':['Hiroshi','Akiko','Yuki','Satoru','Steve']}

data_frame = DataFrame(data)
data_frame

    ID     City  Birth_year     Name
0  100    Tokyo        1990  Hiroshi
1  101    Osaka        1989    Akiko
2  102    Kyoto        1992     Yuki
3  103  Fukuoka        1997   Satoru
4  104    Tokyo        1982    Steve

In [38]:
data_frame_index = DataFrame(data,index = ['a','b','c','d','e'])
data_frame_index

    ID     City  Birth_year     Name
a  100    Tokyo        1990  Hiroshi
b  101    Osaka        1989    Akiko
c  102    Kyoto        1992     Yuki
d  103  Fukuoka        1997   Satoru
e  104    Tokyo        1982    Steve

##行列操作(Matrix operation)

###転置（Transpose）

In [39]:
data_frame_index.T

                  a      b      c        d      e
ID              100    101    102      103    104
City          Tokyo  Osaka  Kyoto  Fukuoka  Tokyo
Birth_year     1990   1989   1992     1997   1982
Name        Hiroshi  Akiko   Yuki   Satoru  Steve

###特定列のみを取り出す（Extract only a specific column）

In [40]:
data_frame_index

    ID     City  Birth_year     Name
a  100    Tokyo        1990  Hiroshi
b  101    Osaka        1989    Akiko
c  102    Kyoto        1992     Yuki
d  103  Fukuoka        1997   Satoru
e  104    Tokyo        1982    Steve

In [41]:
data_frame_index.ID

a    100
b    101
c    102
d    103
e    104
Name: ID, dtype: object

In [42]:
data_frame_index.City

a      Tokyo
b      Osaka
c      Kyoto
d    Fukuoka
e      Tokyo
Name: City, dtype: object

In [43]:
data_frame_index[['ID','City']]

    ID     City
a  100    Tokyo
b  101    Osaka
c  102    Kyoto
d  103  Fukuoka
e  104    Tokyo

##データの抽出（Data extraction）

###条件：フィルター（Filter）

In [44]:
data_frame_index[data_frame_index['City'] == 'Tokyo']

    ID   City  Birth_year     Name
a  100  Tokyo        1990  Hiroshi
e  104  Tokyo        1982    Steve

In [45]:
data_frame_index['City'] == 'Tokyo'

a     True
b    False
c    False
d    False
e     True
Name: City, dtype: bool

##データの削除と結合（Delete and combine data）

###列や行の削除（Delete columns and rows）

In [46]:
data_frame_index.drop(['Birth_year'],axis = 1)

    ID     City     Name
a  100    Tokyo  Hiroshi
b  101    Osaka    Akiko
c  102    Kyoto     Yuki
d  103  Fukuoka   Satoru
e  104    Tokyo    Steve

###データの結合（Combine data）

In [47]:
data_frame1 = data_frame

data2 = {'ID':['100','101','102','105','107'],
        'Math':[50,43,33,76,98],
        'English':[90,30,20,50,30],
        'Sex':['M','F','F','M','M']}
data_frame2 = DataFrame(data2)

In [48]:
data_frame1

    ID     City  Birth_year     Name
0  100    Tokyo        1990  Hiroshi
1  101    Osaka        1989    Akiko
2  102    Kyoto        1992     Yuki
3  103  Fukuoka        1997   Satoru
4  104    Tokyo        1982    Steve

In [49]:
data_frame2

    ID  Math  English Sex
0  100    50       90   M
1  101    43       30   F
2  102    33       20   F
3  105    76       50   M
4  107    98       30   M

In [50]:
pd.merge(data_frame1,data_frame2)

    ID   City  Birth_year     Name  Math  English Sex
0  100  Tokyo        1990  Hiroshi    50       90   M
1  101  Osaka        1989    Akiko    43       30   F
2  102  Kyoto        1992     Yuki    33       20   F

##集計（Aggregate）

In [51]:
data_frame2.groupby('Sex')['Math'].mean()

Sex
F    38.000000
M    74.666667
Name: Math, dtype: float64

##値のソート（Sorting values）

In [52]:
data2 ={'ID':['100','101','102','103','104'],
        'City':['Tokyo','Osaka','Kyoto','Hokkaido','Tokyo'],
        'Birth_year':['1990','1989','1992','1997','1982'],
        'Name':['Hiroshi','Akiko','Yuki','Satoru','Steve']}

data_frame2 = DataFrame(data2)
data_frame2_index = DataFrame(data2,index= ['e','b','a','d','c'])
data_frame2_index

    ID      City Birth_year     Name
e  100     Tokyo       1990  Hiroshi
b  101     Osaka       1989    Akiko
a  102     Kyoto       1992     Yuki
d  103  Hokkaido       1997   Satoru
c  104     Tokyo       1982    Steve

In [53]:
#sort for index

data_frame2_index.sort_index()

    ID      City Birth_year     Name
a  102     Kyoto       1992     Yuki
b  101     Osaka       1989    Akiko
c  104     Tokyo       1982    Steve
d  103  Hokkaido       1997   Satoru
e  100     Tokyo       1990  Hiroshi

In [54]:
#sort for values

data_frame2_index.Birth_year.sort_values()

c    1982
b    1989
e    1990
a    1992
d    1997
Name: Birth_year, dtype: object

##NaN(null)の判定　（Judgment of NaN (null)）

In [55]:
data_frame2_index.isin(['Tokyo'])

      ID   City  Birth_year   Name
e  False   True       False  False
b  False  False       False  False
a  False  False       False  False
d  False  False       False  False
c  False   True       False  False

In [56]:
import numpy as np
data_frame2_index['Name'] = np.nan
data_frame2_index.isnull()

      ID   City  Birth_year  Name
e  False  False       False  True
b  False  False       False  True
a  False  False       False  True
d  False  False       False  True
c  False  False       False  True

In [57]:
data_frame2_index.isnull().sum()

ID            0
City          0
Birth_year    0
Name          5
dtype: int64